app/controllers/booklists_controller.rb

	def new
	    @department = Department.find(params[:department_id])
---
SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT 1  [["id", "1"]]

	def show
 		@booklist = Booklist.find(params[:id])
---
SELECT "booklists".* FROM "booklists" WHERE "booklists"."id" = ? LIMIT 1  [["id", "1"]]

	def create
	    @department = Department.find(params[:department_id])
	    @booklist = @department.booklists.create(params[:booklist])
---
SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "booklists" ("created_at", "creator", "department_id", "intro", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Thu, 27 Jun 2013 10:36:55 UTC +00:00], ["creator", "yeah"], ["department_id", 1], ["intro", "haha"], ["title", "haha"], ["updated_at", Thu, 27 Jun 2013 10:36:55 UTC +00:00]]

	def index
		@department = Department.find(params[:department_id])
		@booklists = @department.booklists.all
---
SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "booklists".* FROM "booklists" WHERE "booklists"."department_id" = 1