app/controllers/comments_controller.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "comments" ("body", "commenter", "created_at", "review_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "test"], ["commenter", "Shao"], ["created_at", Wed, 26 Jun 2013 16:13:38 UTC +00:00], ["review_id", 2], ["updated_at", Wed, 26 Jun 2013 16:13:38 UTC +00:00]]
---
  def create
    @review = Review.find(params[:review_id])
    @comment = @review.comments.create(params[:comment])

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "comments".* FROM "comments" WHERE "comments"."review_id" = 3 AND "comments"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 3]]
---
  def destroy
    @review = Review.find(params[:review_id])
    @comment = @review.comments.find(params[:id])
    if @comment.destroy