app/controllers/departments_controller.rb

	def show
 		@department = Department.find(params[:id])
 		@videos=@department.videos.find(:all, :order => "id desc", :limit => 4)
 		@reviews=@department.reviews.find(:all, :order => "id desc", :limit => 4)
---
SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."department_id" = 1

	def create
		@department = Department.new(params[:department])
		@department.save
---
INSERT INTO "departments" ("created_at", "name", "story", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 27 Jun 2013 01:43:39 UTC +00:00], ["name", "物理系"], ["story", "物理系成立于2013年"], ["updated_at", Thu, 27 Jun 2013 01:43:39 UTC +00:00]]

    def edit
    	@department = Department.find(params[:id])
---
SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT 1  [["id", "1"]]

    def update
    	@department = Department.find(params[:id])
		@department.attributes = params[:department]
		if @department.save
---
SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "departments" SET "coverUrl" = 'http://a4.att.hudong.com/81/48/19300001331264131288483595684.jpg', "updated_at" = '2013-07-01 04:57:49.363321' WHERE "departments"."id" = 1