app/controllers/reviews_controller.rb

SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT 1  [["id", "1"]]
---
	def new
	    @department = Department.find(params[:department_id])

SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "reviews" ("content", "created_at", "creator", "department_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["content", "review"], ["created_at", Thu, 27 Jun 2013 02:51:11 UTC +00:00], ["creator", nil], ["department_id", 1], ["title", "Review1"], ["updated_at", Thu, 27 Jun 2013 02:51:11 UTC +00:00]]
---
	def create
	    @department = Department.find(params[:department_id])
	    @review = @department.reviews.create(params[:review])

SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", "1"]]
---
	def edit
	    @department = Department.find(params[:department_id])
  		@review = Review.find(params[:id])

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "reviews" SET "title" = '《红色警戒》游戏中的“磁暴线圈”科学吗？EE大神来为你解答', "content" = '“经过如上的分析，我们可以明显注意到有一个问题，那就是作为一件武器，特斯拉线圈有一个致命的缺陷——高压放电时电流通常会走阻抗最小的通道，不管流经的是敌人的炮台还是自家人的脑袋……因此，Westwood虚构了一种可以强迫电流改向的技术，为我们伟大的社会主义阵营保住了一条足以匹敌资本家院子里亮晃晃光束的紫色电弧。
---
	def update
		@review = Review.find(params[:id])
		@review.attributes = params[:review]
		if @review.save

SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."department_id" = 1
---
	def index
		@department = Department.find(params[:department_id])
		@reviews = @department.reviews.all