app/controllers/videos_controller.rb

SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT 1  [["id", "1"]]
---
	def new
	    @department = Department.find(params[:department_id])

SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "videos" ("created_at", "department_id", "img", "intro", "title", "updated_at", "url") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def create
	    @department = Department.find(params[:department_id])
	    @video = @department.videos.create(params[:video])

SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", "1"]]
---
	def edit
	    @department = Department.find(params[:department_id])
  		@video = Video.find(params[:id])

SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "videos" SET "title" = '万门大学公开课——【高等数学】 part1', "img" = 'http://g1.ykimg.com/0100401F465136CFF4984508A511B5C4CC1890-2066-0A05-612B-FF2FD2AEC5D7', "url" = 'http://v.youku.com/v_show/id_XNTM3NzgwMzIw.html', "updated_at" = '2013-06-29 00:05:58.556215' WHERE "videos"."id" = 1
---
	def update
		@video = Video.find(params[:id])
		@video.attributes = params[:video]
		if @video.save

SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "videos".* FROM "videos" WHERE "videos"."department_id" = 1
---
	def index
		@department = Department.find(params[:department_id])
		@videos = @department.videos.all